tap "homebrew/bundle"
brew "asdf"
brew "aws-sso-util"
brew "awscli"
brew "bat"
brew "direnv"
brew "fd"
brew "fish"
brew "flux"
brew "fzf"
brew "gh"
brew "git"
brew "git-toolbelt"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "libxslt"
brew "neovim"
brew "node"
brew "openjdk"
brew "pnpm"
brew "ponysay"
brew "rcm"
brew "redis"
brew "ruby", link: true
brew "tig"
brew "tldr"
brew "universal-ctags", args: ["HEAD"]
brew "unzip"
brew "vercel-cli"
brew "watchman"
brew "yq"
cask "enpass"
cask "ghostty"
cask "ngrok"
cask "ollama"
cask "oracle-jdk"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "zed"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "alexdima.copy-relative-path"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "astro-build.astro-vscode"
vscode "attilabuti.vscode-mjml"
vscode "bierner.lit-html"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "codestream.codestream"
vscode "dbaeumer.vscode-eslint"
vscode "dnlytras.nord-wave"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "fabiospampinato.vscode-statusbar-debugger"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "fwcd.kotlin"
vscode "gera2ld.markmap-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "hirosystems.clarity-lsp"
vscode "ibm.output-colorizer"
vscode "jebbs.plantuml"
vscode "jeff-hykin.polacode-2019"
vscode "johnpapa.vscode-peacock"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.csstriggers"
vscode "kisstkondoros.typelens"
vscode "lunaryorn.fish-ide"
vscode "martinjohns.inline-types"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mrorz.language-gettext"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "qezhu.gitlink"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "sirtori.indenticator"
vscode "skyapps.fish-vscode"
vscode "snappify.snappify"
vscode "spikespaz.vscode-smoothtype"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "techer.open-in-browser"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tombyrer.nord-city-theme"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "wakatime.vscode-wakatime"
vscode "wmaurer.vscode-jumpy"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
