tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
tap "heroku/brew"
tap "mongodb/brew"

# brews
brew "universal-ctags", args: ["HEAD"]
brew "git"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "fish"
brew "neovim"
brew "fzf"
brew "exa"
brew "git-flow"
brew "git-toolbelt"
brew "bat"
brew "tig"
brew "tldr"
brew "jq"
brew "termtosvg"
brew "now-cli"
brew "heroku/brew/heroku"
brew "github/gh/gh"
brew "parity"
brew "libyaml"
brew "readline"
brew "coreutils"
brew "yarn"
brew "automake"
brew "autoconf"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "unzip"
brew "gpg"
brew "postgres", restart_service: :changed
brew "redis", restart_service: :changed
brew "mongodb-community"
brew "asdf"
brew "fortune"
brew "ponysay"

# casks
cask "ngrok"
cask "iterm2"
cask "android-studio"
cask "figma"
cask "firefox"
cask "google-chrome-canary"
cask "grammarly"
cask "java"
cask "now"
cask "sketch"
cask "skitch"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "docker"
cask "steam"
cask "intellij-idea-ce"
cask "sonic-pi"
cask "runjs"