tap "thoughtbot/formulae"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
tap "homebrew/cask-versions"
tap "nvie/tap"

# brews
brew "universal-ctags", args: ["HEAD"]
brew "git"
brew "starship"
brew "openssl"
brew "rcm"
brew "fish"
brew "neovim"
brew "fzf"
brew "nvie/tap/git-toolbelt"
brew "bat"
brew "tig"
brew "tldr"
brew "jq"
brew "vercel-cli"
brew "gh"
brew "libyaml"
brew "readline"
brew "coreutils"
brew "automake"
brew "autoconf"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "unzip"
brew "redis", restart_service: :changed
brew "asdf"
brew "ponysay"
brew "fd"
brew "direnv"

# casks
cask "rectangle"
cask "ngrok"
cask "oracle-jdk"
cask "skitch"
cask "spotify"
cask "enpass"
cask "zed"
# cask "ghostty"
# cask "raycast"
# cask "ollama"

